(language-description Mongolian
		      ["Монгол хэл" "Mongol khel"]
		      KHK
		      ((cyrillic alphabet
				 ["а" "б" "в" "г" "д" "е" "ё" "ж" "з" "и" "й"
				  "к" "л" "м" "н" "о" "ө" "п" "р" "с" "т" "у"
				  "ү" "ф" "х" "ц" "ч" "ш" "щ" "ъ" "ы" "ь" "э"
				  "ю" "я"])
		       (mongolian alphabet)))

(def back-vowels ["а" "о" "у" "я" "ё" "ю" "ы" "и"]) ;; и is a front vowel when initial

(def front-vowels ["ө" "ү" "е" "ю" "э" "и"])

(def succeeding-syllable-vowels
  {["а" "аа" "ай" "у" "уу" "уй" "ю" "Юу" "я" "яа"] : ["а" "аа" "уу" "ы" "юу" "яа" "ай" "уй" "иа" "иу"]
   ["э" "ээ" "ү" "үү" "үй" "ю" "юү"] : ["э" "еэ" "үү" "эй" "үй"]
   ["о" "оо" "ой" "ё" "ёо"] : ["о" "ё" "оо" "ёо" "уу" "ы" "ой" "ио"]
   ["ө" "өө" "е" "еө"] : ["ө" "е" "өө" "еө" "үү" "эй" "үй"]
   ["и" "ий"] : ["и" "э" "ээ" "үү" "эй" "үй"]})

